projectFiles/bentPipe/Re5000/q-1000/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (4 0 0);

boundaryField
{
    heatWall
    {
     	type	noSlip;  
    }
    wall
    {
     	type	zeroGradient;
    }
    outlet
    {
    	type	zeroGradient;
    }

    inlet
    {
     	type	fixedValue;
     	value	uniform (4 0 0);
    }
}

// ************************************************************************* //
